# Homebrew bundle — install everything with: brew bundle --file=Brewfile
# Regenerate after installing new tools with: brew bundle dump --force

# CLI tools
brew "eza"          # modern ls
brew "ffmpeg"       # media transcoding
brew "fish"         # shell
brew "fisher"       # fish plugin manager
brew "fnm"          # fast node version manager
brew "fzf"          # fuzzy finder
brew "guile"        # scheme interpreter
brew "jq"           # JSON processor
brew "nmap"         # network scanner
brew "node"         # node.js
brew "pipx"         # isolated python apps
brew "pyenv"        # python version manager
brew "python@3.11"
brew "qemu"         # machine emulator
brew "starship"     # prompt
brew "yt-dlp"       # video downloader

# Libraries (flagged installed-on-request; kept for reproducibility)
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "python@3.12"
brew "libssh"
brew "pkgconf", link: false

