# Homebrew bundle — install everything with: brew bundle --file=Brewfile
# Regenerate after installing new tools with: brew bundle dump --force

# Third-party taps
tap "blackmann/brew"
tap "ddev/ddev"
tap "ngrok/ngrok"
tap "nkzw-tech/tap"
tap "supabase/tap"

# Shell & prompt
brew "fish"             # shell
brew "starship"         # cross-shell prompt
brew "tmux"             # terminal multiplexer

# Editors
brew "neovim"           # vim-fork focused on extensibility

# Git
brew "git"              # version control
brew "gh"               # GitHub CLI
brew "git-delta"        # syntax-highlighting pager for git/diff
brew "difftastic"       # syntax-aware diff
brew "tig"              # text interface for git repos

# File & search utilities
brew "eza"              # modern ls
brew "bat"              # cat with syntax highlighting
brew "ripgrep"          # fast grep
brew "fzf"              # fuzzy finder
brew "television"       # general-purpose fuzzy finder TUI
brew "tree"             # directory tree view
brew "fx"               # terminal JSON viewer
brew "jq"               # JSON processor
brew "python-yq"        # YAML/XML processor wrapping jq
brew "wget"             # file retriever

# HTTP tooling
brew "httpie"           # user-friendly HTTP client
brew "httpstat"         # curl statistics

# Languages & version managers
brew "fnm"              # fast node version manager
brew "pnpm"             # node package manager
brew "pyenv"            # python version manager
brew "pyenv-virtualenv" # pyenv virtualenv plugin
brew "pipx"             # isolated python apps
brew "rust"             # rust language
brew "rustup"           # rust toolchain installer

# Build tools
brew "cmake"            # cross-platform make
brew "xcodegen"         # generate Xcode projects from a spec

# Dev environment
brew "docker"           # containers
brew "ddev/ddev/ddev"   # local PHP/web dev environments
brew "supabase/tap/supabase" # Supabase CLI
brew "mkcert"           # locally trusted dev certificates
brew "nss"              # security libraries (mkcert dependency)
brew "duti"             # set default apps on macOS

# AI / LLM
brew "llm"              # access LLMs from the command-line
brew "opencode"         # AI coding agent for the terminal

# System & misc
brew "btop"             # resource monitor
brew "neofetch"         # system info
brew "mole"             # clean and optimize macOS
brew "cloc"             # count lines of code

# Casks — applications
cask "ghostty"          # terminal emulator
cask "rectangle"        # window manager
cask "1password-cli"    # 1Password CLI
cask "figma"            # design tool
cask "postman"          # API client
cask "httpie"           # HTTP client (desktop)
cask "httpie-desktop"   # HTTP client (desktop)
cask "ngrok"            # localhost tunnels
cask "codiff"           # visual git diff tool
cask "discord"          # chat
cask "spotify"          # music
cask "vlc"              # media player

# Fonts
cask "font-anonymice-powerline"
